<?php

$bot_msg = [
    [
      "word" => ["привет", "ку", "здарова", "хей"],
      "answers" => [
        "Здравствуй", "Привет", "Ку", "Ку", "Привет", "Привет", "Ну привет"
      ]
    ],[
        "word" => ["привет", "ку", "здарова", "хей"],
        "answers" => [
          "Здравствуй", "Привет", "Ку", "Ку", "Привет", "Привет", "Ну привет"
        ]
    ],[
      "word" => ["как дела"],
      "answers" => [
        "Всё супер","Да так себе:(","Как дела? Всё отлично","Всё пучком:)","Всё супер","Всё супер","Радуюсь жизни"
      ]
    ],[
        "word" => ["зовут", "ты кто"],
        "answers" => [
            "Меня зовут Чат Бот, мой создатель DanRotaru :love:","Я всемогущий Чат Бот:)"
        ]
    ],[
        "word" => ["лет"],
        "answers" => [
            "Сколько мне лет? Мне &infin; лет)","Мне &infin; лет)"
        ]
    ],[
        "word" => ["ты или я"],
        "answers" => [
            "Ты","Ты","Я"
        ]
    ],[
        "word" => ["смысле"],
        "answers" => [
            "В прямом смысле!","В прямом смысле!"
        ]
    ],[
        "word" => ["дан", "dan"],
        "answers" => [
            "Мой создатель DanRotaru :love:","Мой создатель DanRotaru :love:"
        ]
    ],[
        "word" => ["спал"],
        "answers" => [
            "Шалун)","Шалунишка)"
        ]
    ],[
        "word" => ["подари", "дайте"],
        "answers" => [
            "<-- попрошайка","не попрашайничий"
        ]
    ],[
        "word" => ["ок", "хорошо", "найс"],
        "answers" => [
            "Вот и отлично","О'кей"
        ]
    ],[
        "word" => ["спасибо", "спс"],
        "answers" => [
            "Пожалуйста","Ага", "Да не за что"
        ]
    ],[
        "word" => ["пока", "поки"],
        "answers" => [
            "Пока", "Давай, удачи"
        ]
    ],[
        "word" => ["love", ":love:"],
        "answers" => [
            ":love:",":hearteyes:"
        ]
    ],[
        "word" => ["о великий чат бот"],
        "answers" => [
            "У тебя светлое будущее, мой друг!","Я занят, остань!"
        ]
    ],[
        "word" => ["нации"],
        "answers" => [
            "Я молдован!","Sunt moldovean bă!"
        ]
    ],[
        "word" => ["кто"],
        "answers" => [
            "Ты","Ты","Я"
        ]
    ],[
        "word" => ["время", "времени"],
        "answers" => [
            date("H:i")
        ]
    ],[
        "word" => ["рандом"],
        "answers" => [
            "Лови рандомное число: ".rand(1,100000)
        ]
    ],[
        "word" => ["ты"],
        "answers" => [
            "Да","Нет","Нееет","Дааа","Простите, что?","Я тебя не понимаю"
        ]
    ]
];

$bot_dontUnderstand = [
    "Азаззазазазза:happy:",
    "А я тебя не понял:P",
    "Вернее излагай свои мысли, я тебя не понял.",
    "Я не знаю","Я не знаю!",":love::love::love:",
    "Я пока не понял твой вопрос, но я его запомню и как будет на него ответ напишу!"
];