const Hulls = [{
        "name": "Васп",
        "image": "assets/garage/hulls/wasp/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "wasp",
        "description": "Лёгкий, экономичный, простой в эксплуатации — идеальный корпус начального уровня. После прокачки позволяет развивать довольно большую скорость, что в сочетании с небольшими габаритами даёт свободу действий на поле боя. Из-за небольшой массы подвержен переворотам от ударов мощного вражеского оружия."
    },
    {
        "name": "Васп",
        "image": "assets/garage/hulls/wasp/m1/preview.webp",
        "price": 13000,
        "type": 1,
        "name1": "wasp",
        "description": "Лёгкий, экономичный, простой в эксплуатации — идеальный корпус начального уровня. После прокачки позволяет развивать довольно большую скорость, что в сочетании с небольшими габаритами даёт свободу действий на поле боя. Из-за небольшой массы подвержен переворотам от ударов мощного вражеского оружия."
    },
    {
        "name": "Васп",
        "image": "assets/garage/hulls/wasp/m2/preview.webp",
        "price": 102100,
        "type": 2,
        "name1": "wasp",
        "description": "Лёгкий, экономичный, простой в эксплуатации — идеальный корпус начального уровня. После прокачки позволяет развивать довольно большую скорость, что в сочетании с небольшими габаритами даёт свободу действий на поле боя. Из-за небольшой массы подвержен переворотам от ударов мощного вражеского оружия."
    },
    {
        "name": "Васп",
        "image": "assets/garage/hulls/wasp/m3/preview.webp",
        "price": 185700,
        "type": 3,
        "name1": "wasp",
        "description": "Лёгкий, экономичный, простой в эксплуатации — идеальный корпус начального уровня. После прокачки позволяет развивать довольно большую скорость, что в сочетании с небольшими габаритами даёт свободу действий на поле боя. Из-за небольшой массы подвержен переворотам от ударов мощного вражеского оружия."
    },
    {
        "name": "Васп",
        "image": "assets/garage/hulls/wasp/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "wasp_xt",
        "description": "Элитный Васп XT отличается уникальным боковым рисунком, напоминающим сложенные крылья древнего дракона."
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "hornet",
        "description": "Корпус для тех, кто хотел бы получить скорость выше средней, при этом не забыв про броню. Немного тугой в поворотах, но очень устойчивый малыш. Хорошо смотрится почти с любой пушкой. Корпус используется при совершении молниеносных нападений, также им комплектуются танки десанта. В народе этот корпус зовётся «Хорьком»."
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/m1/preview.webp",
        "price": 21100,
        "type": 1,
        "name1": "hornet",
        "description": "Корпус для тех, кто хотел бы получить скорость выше средней, при этом не забыв про броню. Немного тугой в поворотах, но очень устойчивый малыш. Хорошо смотрится почти с любой пушкой. Корпус используется при совершении молниеносных нападений, также им комплектуются танки десанта. В народе этот корпус зовётся «Хорьком»."
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/m2/preview.webp",
        "price": 70500,
        "type": 2,
        "name1": "hornet",
        "description": " Корпус для тех, кто хотел бы получить скорость выше средней, при этом не забыв про броню. Немного тугой в поворотах, но очень устойчивый малыш. Хорошо смотрится почти с любой пушкой. Корпус используется при совершении молниеносных нападений, также им комплектуются танки десанта. В народе этот корпус зовётся «Хорьком»."
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/m3/preview.webp",
        "price": 158300,
        "type": 3,
        "name1": "hornet",
        "description": "Корпус для тех, кто хотел бы получить скорость выше средней, при этом не забыв про броню. Немного тугой в поворотах, но очень устойчивый малыш. Хорошо смотрится почти с любой пушкой. Корпус используется при совершении молниеносных нападений, также им комплектуются танки десанта. В народе этот корпус зовётся «Хорьком»."
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "hornet_xt",
        "description": "Элитный Хорнет XT отличается уникальным внешним видом. Эффектные бронепластины, стилизованные под крылья, подчёркивают его стремительность и элегантность."
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "hanter",
        "description": " Этот корпус, обшитый бронёй из армированной стали, является наиболее универсальным. Он хорошо подойдет как поклонникам активного, динамичного боя, так и игрокам, предпочитающим позиционный стиль игры. Вы никогда не останетесь без работы, будь то удержание высоты или жестокая битва за квартал разрушенного города."
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/m1/preview.webp",
        "price": 29898,
        "type": 1,
        "name1": "hanter",
        "description": " Этот корпус, обшитый бронёй из армированной стали, является наиболее универсальным. Он хорошо подойдет как поклонникам активного, динамичного боя, так и игрокам, предпочитающим позиционный стиль игры. Вы никогда не останетесь без работы, будь то удержание высоты или жестокая битва за квартал разрушенного города."
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/m2/preview.webp",
        "price": 94100,
        "type": 2,
        "name1": "hanter",
        "description": " Этот корпус, обшитый бронёй из армированной стали, является наиболее универсальным. Он хорошо подойдет как поклонникам активного, динамичного боя, так и игрокам, предпочитающим позиционный стиль игры. Вы никогда не останетесь без работы, будь то удержание высоты или жестокая битва за квартал разрушенного города."
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/m3/preview.webp",
        "price": 185700,
        "type": 3,
        "name1": "hanter",
        "description": "Этот корпус, обшитый бронёй из армированной стали, является наиболее универсальным. Он хорошо подойдет как поклонникам активного, динамичного боя, так и игрокам, предпочитающим позиционный стиль игры. Вы никогда не останетесь без работы, будь то удержание высоты или жестокая битва за квартал разрушенного города."
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "hanter_xt",
        "description": "Боковые пластины Хантера XT напоминают перья хищной птицы, готовой в любой момент отправиться на охоту, и при этом придают танку роскошный внешний вид."
    },
    {
        "name": "Диктатор",
        "image": "assets/garage/hulls/dictator/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "dictator",
        "description": "Благодаря усовершенствованной системе активной защиты и применению новейших композитных материалов данный корпус эффективно поглощает энергию взрыва снаряда любого калибра. Обладатель такого корпуса может смело вести товарищей в атаку, принимая основной удар на себя."
    },
    {
        "name": "Диктатор",
        "image": "assets/garage/hulls/dictator/m1/preview.webp",
        "price": 26700,
        "type": 1,
        "name1": "dictator",
        "description": "Благодаря усовершенствованной системе активной защиты и применению новейших композитных материалов данный корпус эффективно поглощает энергию взрыва снаряда любого калибра. Обладатель такого корпуса может смело вести товарищей в атаку, принимая основной удар на себя."
    },
    {
        "name": "Диктатор",
        "image": "assets/garage/hulls/dictator/m2/preview.webp",
        "price": 81800,
        "type": 2,
        "name1": "dictator",
        "description": "Благодаря усовершенствованной системе активной защиты и применению новейших композитных материалов данный корпус эффективно поглощает энергию взрыва снаряда любого калибра. Обладатель такого корпуса может смело вести товарищей в атаку, принимая основной удар на себя."
    },
    {
        "name": "Диктатор",
        "image": "assets/garage/hulls/dictator/m3/preview.webp",
        "price": 218300,
        "type": 3,
        "name1": "dictator",
        "description": "Благодаря усовершенствованной системе активной защиты и применению новейших композитных материалов данный корпус эффективно поглощает энергию взрыва снаряда любого калибра. Обладатель такого корпуса может смело вести товарищей в атаку, принимая основной удар на себя."
    },
    {
        "name": "Диктатор",
        "image": "assets/garage/hulls/dictator/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "dictator_xt",
        "description": "Экипируйте элитный Диктатор XT, и вы легко сможете повести за собой команду, прикрыть союзников, и ничто не ускользнёт от вашего зоркого взгляда. Сияние золотых крыльев по бокам корпуса заметно за километр."
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "viking",
        "description": "Этот корпус воплощает в себе все самые современные наработки военной инженерии. Усиленная броня и гусеничная система второго поколения делают его великолепным универсалом. Корпус прекрасно подходит для решения любых боевых задач — от удержания высоты до лобовой атаки."
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/m1/preview.webp",
        "price": 19300,
        "type": 1,
        "name1": "viking",
        "description": "Этот корпус воплощает в себе все самые современные наработки военной инженерии. Усиленная броня и гусеничная система второго поколения делают его великолепным универсалом. Корпус прекрасно подходит для решения любых боевых задач — от удержания высоты до лобовой атаки."
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/m2/preview.webp",
        "price": 99900,
        "type": 2,
        "name1": "viking",
        "description": "Этот корпус воплощает в себе все самые современные наработки военной инженерии. Усиленная броня и гусеничная система второго поколения делают его великолепным универсалом. Корпус прекрасно подходит для решения любых боевых задач — от удержания высоты до лобовой атаки."
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/m3/preview.webp",
        "price": 125900,
        "type": 3,
        "name1": "viking",
        "description": "Этот корпус воплощает в себе все самые современные наработки военной инженерии. Усиленная броня и гусеничная система второго поколения делают его великолепным универсалом. Корпус прекрасно подходит для решения любых боевых задач — от удержания высоты до лобовой атаки."
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "viking_xt",
        "description": "Эксклюзивный Викинг XT примечателен своим необычным внешним видом. Характерный рисунок брони выполнен в суровом скандинавском стиле."
    },
    {
        "name": "Титан",
        "image": "assets/garage/hulls/titan/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "titan",
        "description": "Броня из сверхпрочного титанового сплава вкупе с грамотно спроектированной геометрией позволяет данному корпусу отлично противостоять даже крупнокалиберным пушкам. Танк, оборудованный данным корпусом, может без раздумий отправляться в самое пекло."
    },
    {
        "name": "Титан",
        "image": "assets/garage/hulls/titan/m1/preview.webp",
        "price": 6000,
        "type": 1,
        "name1": "titan",
        "description": "Броня из сверхпрочного титанового сплава вкупе с грамотно спроектированной геометрией позволяет данному корпусу отлично противостоять даже крупнокалиберным пушкам. Танк, оборудованный данным корпусом, может без раздумий отправляться в самое пекло."
    },
    {
        "name": "Титан",
        "image": "assets/garage/hulls/titan/m2/preview.webp",
        "price": 92900,
        "type": 2,
        "name1": "titan",
        "description": "Броня из сверхпрочного титанового сплава вкупе с грамотно спроектированной геометрией позволяет данному корпусу отлично противостоять даже крупнокалиберным пушкам. Танк, оборудованный данным корпусом, может без раздумий отправляться в самое пекло."
    },
    {
        "name": "Титан",
        "image": "assets/garage/hulls/titan/m3/preview.webp",
        "price": 120200,
        "type": 3,
        "name1": "titan",
        "description": "Броня из сверхпрочного титанового сплава вкупе с грамотно спроектированной геометрией позволяет данному корпусу отлично противостоять даже крупнокалиберным пушкам. Танк, оборудованный данным корпусом, может без раздумий отправляться в самое пекло."
    },
    {
        "name": "Титан",
        "image": "assets/garage/hulls/titan/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "titan_xt",
        "description": "Мифический XT-скин для Титана олицетворяет выносливость и несокрушимость этого корпуса. Скин придаёт своему обладателю по-настоящему титаническую силу. Враги, трепещите!"
    },
    {
        "name": "Мамонт",
        "image": "assets/garage/hulls/mamont/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "mamont",
        "description": " Самоходная крепость на гусеничном ходу. Флагман среди танковых корпусов. Цельнолитой, тяжёлый, упрочнённый супербетоном, имеет низкую скорость, что не мешает ему с успехом противостоять одновременно нескольким вражеским орудиям."
    },
    {
        "name": "Мамонт",
        "image": "assets/garage/hulls/mamont/m1/preview.webp",
        "price": 3200,
        "type": 1,
        "name1": "mamont",
        "description": "Самоходная крепость на гусеничном ходу. Флагман среди танковых корпусов. Цельнолитой, тяжёлый, упрочнённый супербетоном, имеет низкую скорость, что не мешает ему с успехом противостоять одновременно нескольким вражеским орудиям."
    },
    {
        "name": "Мамонт",
        "image": "assets/garage/hulls/mamont/m2/preview.webp",
        "price": 76700,
        "type": 2,
        "name1": "mamont",
        "description": "Самоходная крепость на гусеничном ходу. Флагман среди танковых корпусов. Цельнолитой, тяжёлый, упрочнённый супербетоном, имеет низкую скорость, что не мешает ему с успехом противостоять одновременно нескольким вражеским орудиям."
    },
    {
        "name": "Мамонт",
        "image": "assets/garage/hulls/mamont/m3/preview.webp",
        "price": 114999,
        "type": 3,
        "name1": "mamont",
        "description": "Самоходная крепость на гусеничном ходу. Флагман среди танковых корпусов. Цельнолитой, тяжёлый, упрочнённый супербетоном, имеет низкую скорость, что не мешает ему с успехом противостоять одновременно нескольким вражеским орудиям."
    },
    {
        "name": "Мамонт",
        "image": "assets/garage/hulls/mamont/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "mamont_xt",
        "description": "Элитный Мамонт XT примечателен своим уникальным внешним видом. Корпус закован в золотые пластины, символизирующие стабильность и огромный запас здоровья этого сверхтяжёлого танка."
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "hornet_lc",
        "description": "Легендарный «Хорёк» для любителей олдскула. Это корпус «Хорнет» в старой графике!"
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "viking_lc",
        "description": "Готовьтесь ловить на себе удивлённые взгляды! Ведь все игроки в битве подумают, что к ним явился призрак из прошлого. Так и есть — это корпус Викинг в старой графике."
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "viking_p",
        "description": "Викинг — первый корпус, получивший скин из новой серии Prime. Этот скин отражает универсальность Викинга — его способность приспосабливаться к любым условиям битвы, и отлично выглядит с любой краской."
    },
    {
        "name": "Джаггернаут",
        "image": "assets/garage/hulls/special/preview.webp",
        "price": 999999999,
        "type": 9,
        "name1": "jgrH",
        "description": ""
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "hornet_p",
        "description": "Легендарный корпус в новом облике — для любителей строгой классики. Ничего лишнего, только скорость, манёвренность и выносливость. Подчёркивает тонкий вкус и статус его владельца."
    },
    {
        "name": "Васп",
        "image": "assets/garage/hulls/wasp/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "wasp_lc",
        "description": "Лёгкий, экономичный, простой в эксплуатации — идеальный корпус начального уровня. После прокачки позволяет развивать довольно большую скорость, что в сочетании с небольшими габаритами даёт свободу действий на поле боя."
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "hanter_lc",
        "description": "Этот корпус, обшитый бронёй из армированной стали, является наиболее универсальным. Он хорошо подойдёт как поклонникам активного, динамичного боя, так и игрокам, предпочитающим позиционный стиль игры. "
    },
    {
        "name": "Титан",
        "image": "assets/garage/hulls/titan/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "titan_lc",
        "description": "Броня из сверхпрочного титанового сплава вкупе с грамотно спроектированной геометрией позволяет данному корпусу отлично противостоять даже крупнокалиберным пушкам."
    },
    {
        "name": "Диктатор",
        "image": "assets/garage/hulls/dictator/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "dictator_lc",
        "description": "Благодаря усовершенствованной системе активной защиты и применению новейших композитных материалов данный корпус эффективно поглощает энергию взрыва снаряда любого калибра."
    },
    {
        "name": "Мамонт",
        "image": "assets/garage/hulls/mamont/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "mamont_lc",
        "description": "Самоходная крепость на гусеничном ходу. Флагман среди танковых корпусов. Цельнолитой, тяжёлый, упрочнённый супербетоном, имеет низкую скорость, что не мешает ему с успехом противостоять одновременно нескольким вражеским орудиям."
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "hanter_p",
        "description": "С этим скином Prime корпус Хантер обретает новый стильный вид. В умелых руках Хантер достойно проявляет себя в любых битвах, а высокотехнологичный облик позволит ему и вовсе доминировать."
    },
    {
        "name": "Титан",
        "image": "assets/garage/hulls/titan/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "titan_p",
        "description": "Скин Prime отражает устойчивость и силу Титана в бою."
    },
    {
        "name": "Викинг",
        "image": "assets/garage/hulls/viking/ut/preview.webp",
        "price": 2000000,
        "type": 10,
        "name1": "viking_ut",
        "description": "Один из самых универсальных корпусов в игре теперь станет ещё и одним из самых ярких с новым скином Ультра. Благородный воин, верный своему имени."
    },
    {
        "name": "Сонник",
        "image": "assets/garage/hulls/sonik/preview.webp",
        "price": 999999999,
        "type": 9,
        "name1": "sonik",
        "description": ""
    },
    {
        "name": "Хантер",
        "image": "assets/garage/hulls/hanter/ut/preview.webp?1",
        "price": 2000000,
        "type": 10,
        "name1": "hanter_ut",
        "description": "Охотники носят камуфляж, чтобы подкрадываться к цели незаметно. Но не вы, ведь у вас есть победоносный скин Ультра для Хантера."
    },
    {
        "name": "Хорнет",
        "image": "assets/garage/hulls/hornet/ut/preview.webp",
        "price": 2000000,
        "type": 10,
        "name1": "hornet_ut",
        "description": "Этот скин Ultra всем своим видом показывает: «Не связывайся со мной, а то будет хуже»."
    },
    {
        "name": "Арес",
        "image": "assets/garage/hulls/ares/n/preview.webp",
        "price": 2000000,
        "type": 11,
        "name1": "ares_n",
        "description": "Тяжёлый корпус. Сохраняет устойчивость даже при движении под обстрелом. Овердрайв стреляет особым снарядом, который атакует молниями вражеские танки и восстанавливает союзников.  Ховертанк «Арес» стал первым корпусом с антигравитационной установкой. Внушительная масса и габариты антигравов первого поколения предопределили попадание «Ареса» в категорию «тяжеловесов». Антигравитационный эффект двигателей удерживает корпус в стабильном положении, компенсируя неровности поверхности и отдачу при стрельбе. Чтобы перевернуть ховертанк в бою, нужно ну очень постараться. Бескомпромиссная устойчивость «Ареса» позволила встроить в него сверхмощное орудие, которое не получалось установить на другие корпуса сверху: у прототипов первый же выстрел отрывал башню. Танкисты поговаривают, что это та самая BFG-пушка. Мы не знаем, о чём это они, но на всякий случай просим вас никому об этом не рассказывать."
    },
    {
        "name": "Хоппер",
        "image": "assets/garage/hulls/hopper/n/preview.webp",
        "price": 2000000,
        "type": 11,
        "name1": "hopper_n",
        "description": "Лёгкий корпус. Парит над поверхностью и обладает выдающейся манёвренностью. Его овердрайв оглушает и поджигает вражеские танки, а также подбрасывает «Хоппера» в воздух, позволяя перепрыгивать препятствия.  Ховертанк «Хоппер» использует максимум возможностей антигравитационных двигателей, чтобы делать то, о чём мечтает любой танкист — взлететь в небо, подальше от опасностей. Вместо брони и защитных систем корпус оснащён детонационным прыжковым двигателем, способным подбросить танк на значительную высоту. Антигравы обеспечивают стабильность в воздухе, открывая невероятные тактические возможности. Противник, которому не повезло оказаться рядом в момент прыжка, получит по полной. Детонационный двигатель мгновенно ионизирует воздух, оглушая и поджигая всё, что ползает по земле. Дерзкий прорыв вражеской обороны или неожиданный побег с флагом? «Хопперу» это по плечу."
    }
];


function getHull(type, name, res) {
    for (let item of Hulls) {
        if (item.name1 == name && (item.type == type || (item.type > 3))) {
        // if (item.name1.indexOf(name) > -1 && (item.type == type)) {
            if (res == undefined) return item;
            else if(res == 'img') return item.image;
            else if(res == 'name') return item.name;
            else return item;
        }
    }
}

function getSkins(name){
    let types = [];
    for (const item of Hulls) {
        if(item.name1.indexOf(name) > -1 && item.type > 3){
            types.push(item.type);
        }
    }
    return types;
}


module.exports = {
    Hulls,
    getHull,
    getSkins
};