const Turrets = [{
        "name": "Смоки",
        "image": "assets/garage/turrets/smoki/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "smoki",
        "description": "Смоки — самая первая пушка в «ТО». Возможность наносить критический (специальный) урон, на треть превышающий обычный, делает из пушки опасного противника."
    },
    {
        "name": "Смоки",
        "image": "assets/garage/turrets/smoki/m1/preview.webp",
        "price": 11000,
        "type": 1,
        "name1": "smoki",
        "description": "Смоки — самая первая пушка в «ТО». Возможность наносить критический (специальный) урон, на треть превышающий обычный, делает из пушки опасного противника."
    },
    {
        "name": "Смоки",
        "image": "assets/garage/turrets/smoki/m2/preview.webp",
        "price": 114000,
        "type": 2,
        "name1": "smoki",
        "description": "Смоки — самая первая пушка в «ТО». Возможность наносить критический (специальный) урон, на треть превышающий обычный, делает из пушки опасного противника."
    },
    {
        "name": "Смоки",
        "image": "assets/garage/turrets/smoki/m3/preview.webp",
        "price": 151125,
        "type": 3,
        "name1": "smoki",
        "description": "Смоки — самая первая пушка в «ТО». Возможность наносить критический (специальный) урон, на треть превышающий обычный, делает из пушки опасного противника."
    },
    {
        "name": "Смоки",
        "image": "assets/garage/turrets/smoki/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "smoki_xt",
        "description": "Создатель XT-скина для Смоки провёл несколько лет в тропических лесах Южной Америки, изучая жизнь анаконд. Вернувшись домой, он решил воспроизвести образ этой огромной змеи в танковой пушке — так появился этот скин."
    },
    {
        "name": "Огнемёт",
        "image": "assets/garage/turrets/fire/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "fire",
        "description": "Любите погорячее? Хотите сделать бурритос из вашего врага? Тогда это именно ваше оружие! Отличается высоким концентрированным уроном и быстрой башней. Главный плюс Огнемёта для начинающего танкиста — из него не нужно точно целиться, достаточно направить струю огня в сторону противника."
    },
    {
        "name": "Огнемёт",
        "image": "assets/garage/turrets/fire/m1/preview.webp",
        "price": 7100,
        "type": 1,
        "name1": "fire",
        "description": "Любите погорячее? Хотите сделать бурритос из вашего врага? Тогда это именно ваше оружие! Отличается высоким концентрированным уроном и быстрой башней. Главный плюс Огнемёта для начинающего танкиста — из него не нужно точно целиться, достаточно направить струю огня в сторону противника."
    },
    {
        "name": "Огнемёт",
        "image": "assets/garage/turrets/fire/m2/preview.webp",
        "price": 94000,
        "type": 2,
        "name1": "fire",
        "description": "Любите погорячее? Хотите сделать бурритос из вашего врага? Тогда это именно ваше оружие! Отличается высоким концентрированным уроном и быстрой башней. Главный плюс Огнемёта для начинающего танкиста — из него не нужно точно целиться, достаточно направить струю огня в сторону противника."
    },
    {
        "name": "Огнемёт",
        "image": "assets/garage/turrets/fire/m3/preview.webp",
        "price": 171999,
        "type": 3,
        "name1": "fire",
        "description": "Любите погорячее? Хотите сделать бурритос из вашего врага? Тогда это именно ваше оружие! Отличается высоким концентрированным уроном и быстрой башней. Главный плюс Огнемёта для начинающего танкиста — из него не нужно точно целиться, достаточно направить струю огня в сторону противника."
    },
    {
        "name": "Огнемёт",
        "image": "assets/garage/turrets/fire/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "fire_xt",
        "description": "Уникальный Огнемёт XT украшен оригинальным рисунком, стилизованным под голову огнедышащего дракона с горящими глазами."
    },
    {
        "name": "Огнемёт",
        "image": "assets/garage/turrets/fire/dc/preview.webp",
        "price": 777777,
        "type": 7,
        "name1": "fire_dc",
        "description": "Давно искали повод выпустить внутреннего демона наружу? А вот и он. Какой демон с вами сегодня — хитрый чёрт, злая ведьма или таинственный вампир?"
    },
    {
        "name": "Твинс",
        "image": "assets/garage/turrets/twins/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "twins",
        "description": "Если вы хотите вывести из себя вашего врага, то это орудие именно для вас. Твинс — настоящий король режима DM, в котором ему не будет равных из-за очень высокой скорострельности, хорошего сбивания прицела, сплеш-урона и отсутствия необходимости дожидаться перезарядки баллона."
    },
    {
        "name": "Твинс",
        "image": "assets/garage/turrets/twins/m1/preview.webp",
        "price": 35100,
        "type": 1,
        "name1": "twins",
        "description": "Если вы хотите вывести из себя вашего врага, то это орудие именно для вас. Твинс — настоящий король режима DM, в котором ему не будет равных из-за очень высокой скорострельности, хорошего сбивания прицела, сплеш-урона и отсутствия необходимости дожидаться перезарядки баллона."
    },
    {
        "name": "Твинс",
        "image": "assets/garage/turrets/twins/m2/preview.webp",
        "price": 132600,
        "type": 2,
        "name1": "twins",
        "description": "Если вы хотите вывести из себя вашего врага, то это орудие именно для вас. Твинс — настоящий король режима DM, в котором ему не будет равных из-за очень высокой скорострельности, хорошего сбивания прицела, сплеш-урона и отсутствия необходимости дожидаться перезарядки баллона."
    },
    {
        "name": "Твинс",
        "image": "assets/garage/turrets/twins/m3/preview.webp",
        "price": 210000,
        "type": 3,
        "name1": "twins",
        "description": "Если вы хотите вывести из себя вашего врага, то это орудие именно для вас. Твинс — настоящий король режима DM, в котором ему не будет равных из-за очень высокой скорострельности, хорошего сбивания прицела, сплеш-урона и отсутствия необходимости дожидаться перезарядки баллона."
    },
    {
        "name": "Твинс",
        "image": "assets/garage/turrets/twins/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "twins_xt",
        "description": "Твинс XT покрыт шкурой динозавра, чудесным образом сохранившейся невредимой в пещерах Южной Африки. Также при изготовлении скина использовалась лава из индонезийских вулканов, благодаря которой плазма приобретает по-настоящему огненную силу!"
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "railgun",
        "description": "Рельса — поистине универсальная пушка и любимое орудие многих танкистов. Она прекрасно подойдёт как кемперам, предпочитающим уничтожать врагов с большого расстояния из укрытия, так и активным игрокам, предпочитающим много перемещаться по игровому полю."
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/m1/preview.webp",
        "price": 31400,
        "type": 1,
        "name1": "railgun",
        "description": "Рельса — поистине универсальная пушка и любимое орудие многих танкистов. Она прекрасно подойдёт как кемперам, предпочитающим уничтожать врагов с большого расстояния из укрытия, так и активным игрокам, предпочитающим много перемещаться по игровому полю."
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/m2/preview.webp",
        "price": 96100,
        "type": 2,
        "name1": "railgun",
        "description": "Рельса — поистине универсальная пушка и любимое орудие многих танкистов. Она прекрасно подойдёт как кемперам, предпочитающим уничтожать врагов с большого расстояния из укрытия, так и активным игрокам, предпочитающим много перемещаться по игровому полю."
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/m3/preview.webp",
        "price": 218300,
        "type": 3,
        "name1": "railgun",
        "description": "Рельса — поистине универсальная пушка и любимое орудие многих танкистов. Она прекрасно подойдёт как кемперам, предпочитающим уничтожать врагов с большого расстояния из укрытия, так и активным игрокам, предпочитающим много перемещаться по игровому полю."
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "railgun_xt",
        "description": "Уникальная Рельса XT примечательна боковым рисунком, стилизованным под голову орла с характерными хищными очертаниями клюва."
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "railgun_lc",
        "description": "Любимая пушка многих танкистов в новой оболочке, точнее в старой. Legacy-скин для Рельсы напомнит вам, как выглядела эта легендарная пушка в далёком прошлом."
    },
    {
        "name": "Изида",
        "image": "assets/garage/turrets/izida/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "izida",
        "description": "Изида — это в первую очередь орудие для лечения. Также она прекрасно подходит для зарабатывания очков опыта. И только потом — оружие для уничтожения вражеских танков. Большинство игроков желают разить противников направо и налево, а для этого есть более эффективные пушки. Однако если вы всегда мечтали играть роль доктора на полях сражений, то Изида — ваш выбор."
    },
    {
        "name": "Изида",
        "image": "assets/garage/turrets/izida/m1/preview.webp",
        "price": 18600,
        "type": 1,
        "name1": "izida",
        "description": "Изида — это в первую очередь орудие для лечения. Также она прекрасно подходит для зарабатывания очков опыта. И только потом — оружие для уничтожения вражеских танков. Большинство игроков желают разить противников направо и налево, а для этого есть более эффективные пушки. Однако если вы всегда мечтали играть роль доктора на полях сражений, то Изида — ваш выбор."
    },
    {
        "name": "Изида",
        "image": "assets/garage/turrets/izida/m2/preview.webp",
        "price": 68000,
        "type": 2,
        "name1": "izida",
        "description": "Изида — это в первую очередь орудие для лечения. Также она прекрасно подходит для зарабатывания очков опыта. И только потом — оружие для уничтожения вражеских танков. Большинство игроков желают разить противников направо и налево, а для этого есть более эффективные пушки. Однако если вы всегда мечтали играть роль доктора на полях сражений, то Изида — ваш выбор."
    },
    {
        "name": "Изида",
        "image": "assets/garage/turrets/izida/m3/preview.webp",
        "price": 155900,
        "type": 3,
        "name1": "izida",
        "description": "Изида — это в первую очередь орудие для лечения. Также она прекрасно подходит для зарабатывания очков опыта. И только потом — оружие для уничтожения вражеских танков. Большинство игроков желают разить противников направо и налево, а для этого есть более эффективные пушки. Однако если вы всегда мечтали играть роль доктора на полях сражений, то Изида — ваш выбор."
    },
    {
        "name": "Изида",
        "image": "assets/garage/turrets/izida/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "izida_xt",
        "description": "Элегантная Изида XT стилизована под голову ворона. Считается, что этот облик достаётся только лучшим боевым медикам, способным молниеносно прийти на помощь раненому бойцу."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "grom",
        "description": "Среднекалиберная пушка — это лучший выбор для любителей динамичного боя. Разрывной снаряд Грома (осторожно, можно нанести урон самому себе) позволяет атаковать группу соперников, а быстрая перезарядка поможет получить неоспоримое преимущество перед тяжёлыми танками противника."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/m1/preview.webp",
        "price": 38600,
        "type": 1,
        "name1": "grom",
        "description": "Среднекалиберная пушка — это лучший выбор для любителей динамичного боя. Разрывной снаряд Грома (осторожно, можно нанести урон самому себе) позволяет атаковать группу соперников, а быстрая перезарядка поможет получить неоспоримое преимущество перед тяжёлыми танками противника."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/m2/preview.webp",
        "price": 100500,
        "type": 2,
        "name1": "grom",
        "description": "Среднекалиберная пушка — это лучший выбор для любителей динамичного боя. Разрывной снаряд Грома (осторожно, можно нанести урон самому себе) позволяет атаковать группу соперников, а быстрая перезарядка поможет получить неоспоримое преимущество перед тяжёлыми танками противника."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/m3/preview.webp",
        "price": 156200,
        "type": 3,
        "name1": "grom",
        "description": "Среднекалиберная пушка — это лучший выбор для любителей динамичного боя. Разрывной снаряд Грома (осторожно, можно нанести урон самому себе) позволяет атаковать группу соперников, а быстрая перезарядка поможет получить неоспоримое преимущество перед тяжёлыми танками противника."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "grom_xt",
        "description": "Эксклюзивный Гром XT заставит вас почувствовать себя в шкуре грозного хищного зверя."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "grom_lc",
        "description": "Legacy-скин для Грома поможет вам окунуться в атмосферу «старых Танков». А если вы старожил игры — сможете вспомнить ваши ощущения от первых боёв."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "grom_p",
        "description": "Гром — первая пушка, получившая скин из новой серии Prime. Этот скин подчёркивает брутальность пушки и серьёзность намерений её владельца. Зачем красоваться, когда можно сильно ударить!"
    },
    {
        "name": "Фриз",
        "image": "assets/garage/turrets/friz/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "friz",
        "description": "На первый взгляд Фриз очень напоминает Огнемёт. Однако от своего собрата с поджигающим действием он отличается возможностью наглухо остановить противника и добить, отъехав с линии огня, пока враг пытается навести свой прицел. В режиме CTF именно благодаря Фризу флаги редко покидают пределы родной базы."
    },
    {
        "name": "Фриз",
        "image": "assets/garage/turrets/friz/m1/preview.webp",
        "price": 20600,
        "type": 1,
        "name1": "friz",
        "description": "На первый взгляд Фриз очень напоминает Огнемёт. Однако от своего собрата с поджигающим действием он отличается возможностью наглухо остановить противника и добить, отъехав с линии огня, пока враг пытается навести свой прицел. В режиме CTF именно благодаря Фризу флаги редко покидают пределы родной базы."
    },
    {
        "name": "Фриз",
        "image": "assets/garage/turrets/friz/m2/preview.webp",
        "price": 55400,
        "type": 2,
        "name1": "friz",
        "description": "На первый взгляд Фриз очень напоминает Огнемёт. Однако от своего собрата с поджигающим действием он отличается возможностью наглухо остановить противника и добить, отъехав с линии огня, пока враг пытается навести свой прицел. В режиме CTF именно благодаря Фризу флаги редко покидают пределы родной базы."
    },
    {
        "name": "Фриз",
        "image": "assets/garage/turrets/friz/m3/preview.webp",
        "price": 171500,
        "type": 3,
        "name1": "friz",
        "description": "На первый взгляд Фриз очень напоминает Огнемёт. Однако от своего собрата с поджигающим действием он отличается возможностью наглухо остановить противника и добить, отъехав с линии огня, пока враг пытается навести свой прицел. В режиме CTF именно благодаря Фризу флаги редко покидают пределы родной базы."
    },
    {
        "name": "Фриз",
        "image": "assets/garage/turrets/friz/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "friz_xt",
        "description": "Уникальный Фриз XT стилизован под голову мамонта. Крепкие серебряные бивни послужат отличным оружием для нападения или защиты от врагов."
    },
    {
        "name": "Рикошет",
        "image": "assets/garage/turrets/rik/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "rik",
        "description": "Рикошет — весьма мощная и эффективная пушка, однако одна из самых сложных в обращении. Шарики Рикошета отражаются от стен, а углы самонаведения по вертикали внушают уважение. Всё это позволяет эффективно попадать по прячущимся в укрытиях целям. Однако стрельба на большие расстояния, а также по движущемуся противнику с упреждением представляет собой непростую задачу. Настолько, что многие игроки считают Рикошет оружием исключительно ближнего боя, что верно лишь отчасти."
    },
    {
        "name": "Рикошет",
        "image": "assets/garage/turrets/rik/m1/preview.webp",
        "price": 24100,
        "type": 1,
        "name1": "rik",
        "description": "Рикошет — весьма мощная и эффективная пушка, однако одна из самых сложных в обращении. Шарики Рикошета отражаются от стен, а углы самонаведения по вертикали внушают уважение. Всё это позволяет эффективно попадать по прячущимся в укрытиях целям. Однако стрельба на большие расстояния, а также по движущемуся противнику с упреждением представляет собой непростую задачу. Настолько, что многие игроки считают Рикошет оружием исключительно ближнего боя, что верно лишь отчасти."
    },
    {
        "name": "Рикошет",
        "image": "assets/garage/turrets/rik/m2/preview.webp",
        "price": 89200,
        "type": 2,
        "name1": "rik",
        "description": "Рикошет — весьма мощная и эффективная пушка, однако одна из самых сложных в обращении. Шарики Рикошета отражаются от стен, а углы самонаведения по вертикали внушают уважение. Всё это позволяет эффективно попадать по прячущимся в укрытиях целям. Однако стрельба на большие расстояния, а также по движущемуся противнику с упреждением представляет собой непростую задачу. Настолько, что многие игроки считают Рикошет оружием исключительно ближнего боя, что верно лишь отчасти."
    },
    {
        "name": "Рикошет",
        "image": "assets/garage/turrets/rik/m3/preview.webp",
        "price": 252100,
        "type": 3,
        "name1": "rik",
        "description": "Рикошет — весьма мощная и эффективная пушка, однако одна из самых сложных в обращении. Шарики Рикошета отражаются от стен, а углы самонаведения по вертикали внушают уважение. Всё это позволяет эффективно попадать по прячущимся в укрытиях целям. Однако стрельба на большие расстояния, а также по движущемуся противнику с упреждением представляет собой непростую задачу. Настолько, что многие игроки считают Рикошет оружием исключительно ближнего боя, что верно лишь отчасти."
    },
    {
        "name": "Рикошет",
        "image": "assets/garage/turrets/rik/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "rik_xt",
        "description": "Рикошет XT стилизован под крокодилью пасть. Крепкие острые зубы заставят ваших врагов сто раз подумать, прежде чем нападать."
    },
    {
        "name": "Шафт",
        "image": "assets/garage/turrets/shaft/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "shaft",
        "description": "Шафт может стрелять по противнику как в аркадном режиме, что называется, «навскидку» (как и любая другая пушка), так и в снайперском режиме с использованием оптического прицела и с накоплением заряда."
    },
    {
        "name": "Шафт",
        "image": "assets/garage/turrets/shaft/m1/preview.webp",
        "price": 17900,
        "type": 1,
        "name1": "shaft",
        "description": "Шафт может стрелять по противнику как в аркадном режиме, что называется, «навскидку» (как и любая другая пушка), так и в снайперском режиме с использованием оптического прицела и с накоплением заряда."
    },
    {
        "name": "Шафт",
        "image": "assets/garage/turrets/shaft/m2/preview.webp",
        "price": 103600,
        "type": 2,
        "name1": "shaft",
        "description": "Шафт может стрелять по противнику как в аркадном режиме, что называется, «навскидку» (как и любая другая пушка), так и в снайперском режиме с использованием оптического прицела и с накоплением заряда."
    },
    {
        "name": "Шафт",
        "image": "assets/garage/turrets/shaft/m3/preview.webp",
        "price": 175200,
        "type": 3,
        "name1": "shaft",
        "description": "Шафт может стрелять по противнику как в аркадном режиме, что называется, «навскидку» (как и любая другая пушка), так и в снайперском режиме с использованием оптического прицела и с накоплением заряда."
    },
    {
        "name": "Шафт",
        "image": "assets/garage/turrets/shaft/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "shaft_xt",
        "description": "Золотой лев с серебристой гривой, воплощённый в облике Шафта XT, станет вашим преданным боевым товарищем и поможет защитить ваш прайд."
    },
    {
        "name": "Шафт",
        "image": "assets/garage/turrets/shaft/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "shaft_lc",
        "description": "Легендарная пушка — Шафт. Была добавлена в игру 29 июня 2011 года. Пушка Шафт была спроектирована учёными, которые наделили её огромным количеством функций."
    },
    {
        "name": "Молот",
        "image": "assets/garage/turrets/molot/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "molot",
        "description": "Пушка обладает особенной механикой дробовика. Говоря другими словами, за несколько секунд вы можете совершить три выстрела дробью и затем перезарядиться. Молот полезен для молниеносных атак на базу противников в момент, когда на ней находится малое количество вражеских танков. Уничтожив с «барабана» защитников, можно забрать флаг и уехать."
    },
    {
        "name": "Молот",
        "image": "assets/garage/turrets/molot/m1/preview.webp",
        "price": 37000,
        "type": 1,
        "name1": "molot",
        "description": "Пушка обладает особенной механикой дробовика. Говоря другими словами, за несколько секунд вы можете совершить три выстрела дробью и затем перезарядиться. Молот полезен для молниеносных атак на базу противников в момент, когда на ней находится малое количество вражеских танков. Уничтожив с «барабана» защитников, можно забрать флаг и уехать."
    },
    {
        "name": "Молот",
        "image": "assets/garage/turrets/molot/m2/preview.webp",
        "price": 117000,
        "type": 2,
        "name1": "molot",
        "description": "Пушка обладает особенной механикой дробовика. Говоря другими словами, за несколько секунд вы можете совершить три выстрела дробью и затем перезарядиться. Молот полезен для молниеносных атак на базу противников в момент, когда на ней находится малое количество вражеских танков. Уничтожив с «барабана» защитников, можно забрать флаг и уехать."
    },
    {
        "name": "Молот",
        "image": "assets/garage/turrets/molot/m3/preview.webp",
        "price": 182000,
        "type": 3,
        "name1": "molot",
        "description": "Пушка обладает особенной механикой дробовика. Говоря другими словами, за несколько секунд вы можете совершить три выстрела дробью и затем перезарядиться. Молот полезен для молниеносных атак на базу противников в момент, когда на ней находится малое количество вражеских танков. Уничтожив с «барабана» защитников, можно забрать флаг и уехать."
    },
    {
        "name": "Молот",
        "image": "assets/garage/turrets/molot/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "molot_xt",
        "description": "Грозный Молот XT своим видом напоминает голову носорога. С этим скином в поединке вам не будет равных — нацельте рог на вашего врага и сокрушите его мощным ударом. P.S. При создании этого скина ни один носорог не пострадал."
    },
    {
        "name": "Вулкан",
        "image": "assets/garage/turrets/vulkan/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "vulkan",
        "description": "Вулкан — скорострельная пушка-пулемёт, единственная пушка в игре, которая позволяет вам управлять корпусом, в то время как башня направлена в нужную сторону. Вулкан хорош как для защиты собственной базы, так и для поддержки атаки. Часто устанавливается на средние корпуса. Не забывайте использовать модули с защитой от Огнемёта, чтобы уменьшить самоурон от перегрева."
    },
    {
        "name": "Вулкан",
        "image": "assets/garage/turrets/vulkan/m1/preview.webp",
        "price": 28300,
        "type": 1,
        "name1": "vulkan",
        "description": "Вулкан — скорострельная пушка-пулемёт, единственная пушка в игре, которая позволяет вам управлять корпусом, в то время как башня направлена в нужную сторону. Вулкан хорош как для защиты собственной базы, так и для поддержки атаки. Часто устанавливается на средние корпуса. Не забывайте использовать модули с защитой от Огнемёта, чтобы уменьшить самоурон от перегрева."
    },
    {
        "name": "Вулкан",
        "image": "assets/garage/turrets/vulkan/m2/preview.webp",
        "price": 72700,
        "type": 2,
        "name1": "vulkan",
        "description": "Вулкан — скорострельная пушка-пулемёт, единственная пушка в игре, которая позволяет вам управлять корпусом, в то время как башня направлена в нужную сторону. Вулкан хорош как для защиты собственной базы, так и для поддержки атаки. Часто устанавливается на средние корпуса. Не забывайте использовать модули с защитой от Огнемёта, чтобы уменьшить самоурон от перегрева."
    },
    {
        "name": "Вулкан",
        "image": "assets/garage/turrets/vulkan/m3/preview.webp",
        "price": 181777,
        "type": 3,
        "name1": "vulkan",
        "description": "Вулкан — скорострельная пушка-пулемёт, единственная пушка в игре, которая позволяет вам управлять корпусом, в то время как башня направлена в нужную сторону. Вулкан хорош как для защиты собственной базы, так и для поддержки атаки. Часто устанавливается на средние корпуса. Не забывайте использовать модули с защитой от Огнемёта, чтобы уменьшить самоурон от перегрева."
    },
    {
        "name": "Вулкан",
        "image": "assets/garage/turrets/vulkan/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "vulkan_xt",
        "description": "Уникальная модель Вулкана, отличающаяся от стандартной версии пушки необычным внешним видом. Башня покрыта золотой змеиной кожей и инкрустирована рубинами, напоминающими глаза змеи."
    },
    {
        "name": "Страйкер",
        "image": "assets/garage/turrets/striker/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "striker",
        "description": "Противотанковый ракетный комплекс, эффективный на средней и большой дальности. Комплекс оснащён системой лазерного наведения для запуска самонаводящихся ракет. Подойдёт к любому корпусу, но для упрощения прицеливания лучше выбрать наиболее тяжёлый."
    },
    {
        "name": "Страйкер",
        "image": "assets/garage/turrets/striker/m1/preview.webp",
        "price": 24750,
        "type": 1,
        "name1": "striker",
        "description": "Противотанковый ракетный комплекс, эффективный на средней и большой дальности. Комплекс оснащён системой лазерного наведения для запуска самонаводящихся ракет. Подойдёт к любому корпусу, но для упрощения прицеливания лучше выбрать наиболее тяжёлый."
    },
    {
        "name": "Страйкер",
        "image": "assets/garage/turrets/striker/m2/preview.webp",
        "price": 110810,
        "type": 2,
        "name1": "striker",
        "description": "Противотанковый ракетный комплекс, эффективный на средней и большой дальности. Комплекс оснащён системой лазерного наведения для запуска самонаводящихся ракет. Подойдёт к любому корпусу, но для упрощения прицеливания лучше выбрать наиболее тяжёлый."
    },
    {
        "name": "Страйкер",
        "image": "assets/garage/turrets/striker/m3/preview.webp",
        "price": 185360,
        "type": 3,
        "name1": "striker",
        "description": "Противотанковый ракетный комплекс, эффективный на средней и большой дальности. Комплекс оснащён системой лазерного наведения для запуска самонаводящихся ракет. Подойдёт к любому корпусу, но для упрощения прицеливания лучше выбрать наиболее тяжёлый."
    },
    {
        "name": "Страйкер",
        "image": "assets/garage/turrets/striker/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "striker_xt",
        "description": "Создатели этого скина были вдохновлены подводным миром, полным опасностей, и его загадочными обитателями. Пронзительный взгляд морского демона словно держит врагов на прицеле, а хищная мурена готова вцепиться своими острыми зубами в любую мишень."
    },
    {
        "name": "Магнум",
        "image": "assets/garage/turrets/magnum/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "magnum",
        "description": "Магнум — это тяжёлое дальнобойное артиллерийское орудие, способное достать противника где угодно, даже если он прячется за зданием. Мощности выстрела хватит, чтобы доставить снаряд в любую точку даже самой большой карты. Рассчитать нужный угол подъёма ствола, мощность и упреждение — задача непростая, но затраченные усилия стоят того, когда вы видите, как снаряд приземляется точно на «макушку» вражеского танка."
    },
    {
        "name": "Магнум",
        "image": "assets/garage/turrets/magnum/m1/preview.webp",
        "price": 28950,
        "type": 1,
        "name1": "magnum",
        "description": "Магнум — это тяжёлое дальнобойное артиллерийское орудие, способное достать противника где угодно, даже если он прячется за зданием. Мощности выстрела хватит, чтобы доставить снаряд в любую точку даже самой большой карты. Рассчитать нужный угол подъёма ствола, мощность и упреждение — задача непростая, но затраченные усилия стоят того, когда вы видите, как снаряд приземляется точно на «макушку» вражеского танка."
    },
    {
        "name": "Магнум",
        "image": "assets/garage/turrets/magnum/m2/preview.webp",
        "price": 127360,
        "type": 2,
        "name1": "magnum",
        "description": "Магнум — это тяжёлое дальнобойное артиллерийское орудие, способное достать противника где угодно, даже если он прячется за зданием. Мощности выстрела хватит, чтобы доставить снаряд в любую точку даже самой большой карты. Рассчитать нужный угол подъёма ствола, мощность и упреждение — задача непростая, но затраченные усилия стоят того, когда вы видите, как снаряд приземляется точно на «макушку» вражеского танка."
    },
    {
        "name": "Магнум",
        "image": "assets/garage/turrets/magnum/m3/preview.webp",
        "price": 195200,
        "type": 3,
        "name1": "magnum",
        "description": "Магнум — это тяжёлое дальнобойное артиллерийское орудие, способное достать противника где угодно, даже если он прячется за зданием. Мощности выстрела хватит, чтобы доставить снаряд в любую точку даже самой большой карты. Рассчитать нужный угол подъёма ствола, мощность и упреждение — задача непростая, но затраченные усилия стоят того, когда вы видите, как снаряд приземляется точно на «макушку» вражеского танка."
    },
    {
        "name": "Магнум",
        "image": "assets/garage/turrets/magnum/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "magnum_xt",
        "description": "Обладатель Магнума XT выделяется на поле боя благодаря устрашающему виду этой разрушительной пушки. Опытные артиллеристы утверждают, что этот эксклюзивный скин помогает попадать прямо в яблочко даже на самых больших боевых аренах."
    },
    {
        "name": "Терминатор",
        "image": "assets/garage/turrets/special/preview.webp",
        "price": 999999999,
        "type": 9,
        "name1": "jgrT",
        "description": ""
    },
    {
        "name": "Гаусс",
        "image": "assets/garage/turrets/gauss/m0/preview.webp",
        "price": 0,
        "type": 0,
        "name1": "gauss",
        "description": "Пушка \"Гаусс\" родилась в гаражах танкистов, пытавшихся подручными средствами повысить эффективность Грома в борьбе со снайперами. Оказалось, что обмотка ствола сверхпроводящей проволокой придаёт выстрелам колоссальное ускорение за счет эффекта электромагнитизма. Разогнанный таким способом снаряд не уступает по дальности выстрелам Рельсотрона и бабахает особенно громко. А когда кустарную модификацию Грома оснастили современным комплекса прицеливания и сопровождения цели, появилась Гаусс-пушка - самый мобильный снайпер на поле боя. Пока стрелок на полной скорости уклоняется от огня противника, системы наведения Гаусса самостоятельно делают точный выстрел в оптимальный момент.."
    },
    {
        "name": "Гаусс",
        "image": "assets/garage/turrets/gauss/m1/preview.webp",
        "price": 28000,
        "type": 1,
        "name1": "gauss",
        "description": "Пушка \"Гаусс\" родилась в гаражах танкистов, пытавшихся подручными средствами повысить эффективность Грома в борьбе со снайперами. Оказалось, что обмотка ствола сверхпроводящей проволокой придаёт выстрелам колоссальное ускорение за счет эффекта электромагнитизма. Разогнанный таким способом снаряд не уступает по дальности выстрелам Рельсотрона и бабахает особенно громко. А когда кустарную модификацию Грома оснастили современным комплекса прицеливания и сопровождения цели, появилась Гаусс-пушка - самый мобильный снайпер на поле боя. Пока стрелок на полной скорости уклоняется от огня противника, системы наведения Гаусса самостоятельно делают точный выстрел в оптимальный момент.."
    },
    {
        "name": "Гаусс",
        "image": "assets/garage/turrets/gauss/m2/preview.webp",
        "price": 72000,
        "type": 2,
        "name1": "gauss",
        "description": "Пушка \"Гаусс\" родилась в гаражах танкистов, пытавшихся подручными средствами повысить эффективность Грома в борьбе со снайперами. Оказалось, что обмотка ствола сверхпроводящей проволокой придаёт выстрелам колоссальное ускорение за счет эффекта электромагнитизма. Разогнанный таким способом снаряд не уступает по дальности выстрелам Рельсотрона и бабахает особенно громко. А когда кустарную модификацию Грома оснастили современным комплекса прицеливания и сопровождения цели, появилась Гаусс-пушка - самый мобильный снайпер на поле боя. Пока стрелок на полной скорости уклоняется от огня противника, системы наведения Гаусса самостоятельно делают точный выстрел в оптимальный момент.."
    },
    {
        "name": "Гаусс",
        "image": "assets/garage/turrets/gauss/m3/preview.webp",
        "price": 147000,
        "type": 3,
        "name1": "gauss",
        "description": "Пушка \"Гаусс\" родилась в гаражах танкистов, пытавшихся подручными средствами повысить эффективность Грома в борьбе со снайперами. Оказалось, что обмотка ствола сверхпроводящей проволокой придаёт выстрелам колоссальное ускорение за счет эффекта электромагнитизма. Разогнанный таким способом снаряд не уступает по дальности выстрелам Рельсотрона и бабахает особенно громко. А когда кустарную модификацию Грома оснастили современным комплекса прицеливания и сопровождения цели, появилась Гаусс-пушка - самый мобильный снайпер на поле боя. Пока стрелок на полной скорости уклоняется от огня противника, системы наведения Гаусса самостоятельно делают точный выстрел в оптимальный момент.."
    },
    {
        "name": "Молот",
        "image": "assets/garage/turrets/molot/tc/preview.webp",
        "price": 666666,
        "type": 8,
        "name1": "molot_tc",
        "description": "Молот ТС - первая версия молота ещё с далёких 2017. Молот полезен для молниеносных атак на базу противников в момент, когда на ней находится малое количество вражеских танков. Уничтожив с «барабана» защитников, можно забрать флаг и уехать."
    },
    {
        "name": "Смоки",
        "image": "assets/garage/turrets/smoki/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "smoki_lc",
        "description": "Среднекалиберная танковая пушка. В основном, устанавливается на лёгкие истребительные и учебные танки. Получила распространение из-за дешевизны и простоты обслуживания. Установите её на быстрый корпус и, шныряя между ошарашенными врагами, берите тяжёлые неповоротливые танки на измор. Разработанные апгрейды способны существенно увеличить убойную силу этой малышки."
    },
    {
        "name": "Огнемёт",
        "image": "assets/garage/turrets/fire/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "fire_lc",
        "description": "В тесных городских кварталах, когда картина боя напоминает скорее муравейник, нет лучшего оружия, чем Огнемёт. Огнемёт является этаким оружием массового поражения для ближнего боя. Высокая температура горения смеси позволит быстро поджечь экипаж танка зазевавшегося противника, после чего скрыться за углом, пока враг догорает. Идеальное оружие против медленных танков в условиях ограниченного пространства."
    },
    {
        "name": "Твинс",
        "image": "assets/garage/turrets/twins/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "twins_lc",
        "description": "Скорострельный двуствольный плазмомёт вмиг превратит врага в кучу расплавленного железа. Учитывая то, что попадание во вражеский танк сбивает ему прицел, это оружие идеально подходит для динамичного боя на средней дистанции."
    },
    {
        "name": "Изида",
        "image": "assets/garage/turrets/izida/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "izida_lc",
        "description": "Уникальная идея этого оружия зародилась ещё во времена холодной войны, но смогла воплотиться только с развитием квантовой физики и нанотехнологий. Сердце этой чудо-машины — генератор нанороботов, способных воспроизвести или разрушить структуру любого материала небиологического происхождения."
    },
    {
        "name": "Фриз",
        "image": "assets/garage/turrets/friz/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "friz_lc",
        "description": "Концепция грозной установки «Фриз» родилась в глухой русской деревне. Из неисправного холодильника «Север» и пылесоса «Буран» местный кулибин собрал «хладомёт». Новинку заметил рыбачивший в тех краях инженер."
    },
    {
        "name": "Рикошет",
        "image": "assets/garage/turrets/rik/lgc/preview.webp",
        "price": 600000,
        "type": 5,
        "name1": "rik_lc",
        "description": "Плазмомёт «Рикошет» — это новая секретная разработка сибирских ученых. Чтобы поставить её на вооружение, команда из 22 специалистов три года работала в подземном бункере без права выхода на поверхность. "
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "railgun_p",
        "description": "Этот скин был изготовлен из частей космического корабля, совершившего первую экспедицию на Плутон. По данным NASA, загадочный «синий глаз» способен точно отслеживать цели на расстоянии нескольких миллиардов километров. У ваших противников нет шансов."
    },
    {
        "name": "Гаусс",
        "image": "assets/garage/turrets/gauss/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "gauss_p",
        "description": "Этот скин создан специально для снайперов-виртуозов, для тех, кто за короткое время смог приручить «ушастого дьявола». Выглядит круто и опасно."
    },
    {
        "name": "Вулкан",
        "image": "assets/garage/turrets/vulkan/p/preview.webp",
        "price": 1000000,
        "type": 6,
        "name1": "vulkan_p",
        "description": "Вулкан в жарких сражениях всегда находится на стороне победителей. С этим скином вы будете не только доминировать в бою, но и потрясающе выглядеть."
    },
    {
        "name": "Гром",
        "image": "assets/garage/turrets/grom/ut/preview.webp",
        "price": 2000000,
        "type": 10,
        "name1": "grom_ut",
        "description": "В умелых руках Гром грациозен и смертоносен. А с новым скином Ультра он выглядит ещё круче!"
    },
    {
        "name": "Рельса",
        "image": "assets/garage/turrets/railgun/ut/preview.webp",
        "price": 2000000,
        "type": 10,
        "name1": "railgun_ut",
        "description": "Рельса является одним из основных видов вооружения для чемпионов киберспорта. Теперь эта популярная пушка имеет скин Ультра, чтобы поддерживать свою уникальную репутацию."
    },
    {
        "name": "Гаусс",
        "image": "assets/garage/turrets/gauss/xt/preview.webp",
        "price": 500000,
        "type": 4,
        "name1": "gauss_xt",
        "description": "Говорят, что внешность — это не главное. Но когда наступает время битвы, запугивание становится хорошей тактикой. Гаусс XT вселяет в соперников ужас и предупреждает их о жёстких ударах, которые обязательно последуют."
    },
    {
        "name": "Гаусс",
        "image": "assets/garage/turrets/gauss/ut/preview.webp",
        "price": 2000000,
        "type": 10,
        "name1": "gauss_ut",
        "description": "Такая многогранная и смертоносная пушка, как Гаусс, заслуживает столь же впечатляющего скина. А вот и он, скин Ультра для Гаусса."
    },
    {
        "name": "Вулкан",
        "image": "assets/garage/turrets/vulkan/ut/preview.webp",
        "price": 2000000,
        "type": 10,
        "name1": "vulkan_ut",
        "description": "Король скорострельности — теперь с новым скином Ультра. Он поможет вам уничтожать вражеские танки не только эффективно, но и грациозно."
    }
];

function getTurret(type, name, res) {
    for (let item of Turrets) {
        // if (item.name1.indexOf(name) > -1 && (item.type == type)) {
        if (item.name1 == name && (item.type == type || (item.type > 3))) {
            if (res == undefined) return item;
            else if(res == 'img') return item.image;
            else if(res == 'name') return item.name;
            else return item;
        }
    }
}

function getSkins(name){
    let types = [];
    for (const item of Turrets) {
        if(item.name1.indexOf(name) > -1 && item.type > 3){
            types.push(item.type);
        }
    }
    return types;
}

module.exports = {
    Turrets,
    getTurret,
    getSkins
}